Revit 2024 API
SymbolTypeId.DegreeCInterval Property
 Symbol °C, indicating unit Celsius interval.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId DegreeCInterval { get; }
Visual Basic
Public Shared ReadOnly Property DegreeCInterval As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ DegreeCInterval {
	ForgeTypeId^ get ();
}
See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace